# ЗАДАНИЕ 12.7.3 (HW-03)
'''Вам дан словарь per_cent с распределением процентных ставок по вкладам
в различных банках таким образом, что ключ — название банка,
значение — процент. Напишите программу, в результате которой будет сформирован
список deposit значений — накопленные средства за год вклада в каждом из банков.
На вход программы с клавиатуры вводится сумма money, которую человек планирует
положить под проценты.
Добавьте в программу поиск максимального значения и его вывод на экран'''

per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}

money = int(input('Введите сумму: '))
deposit = [int(money * i * 0.01) for i in per_cent.values()]

print(f'Максимальная сумма, которую вы можете заработать — {max(deposit)}')