import time

class Backyard:
    # Вместо BOT TOKEN HERE нужно вставить токен вашего бота, полученный у @BotFather
    TOKEN = 'BOT TOKEN HERE'

    URL = 'https://min-api.cryptocompare.com/data/price?'

    KEYS = {
        'доллар': ['USD', "(США)"],
        'евро': ['EUR', "(Евросоюз)"],
        'рубль': ['RUB', "(Россия)"],
        'лира': ['TRY', "(Турция)"],
        'фунт': ['GBP', "(Великобритания)"],
        'шекель': ['ILS', "(Израиль)"],
        'крона': ['DKK', "(Дания)"],
        'гривна': ['UAH', "(Украина)"],
        'иена': ['JPY', "(Япония)"],
        'юань': ['CNY', "(Китай)"],
        'злотый': ['PLN', "(Польша)"],
        'песо': ['CUP', "(Куба)"],
        'биткоин': ['BTC', " "]
    }

    TEXT_HELLO = 'Привет!\nМеня зовут <i><b>CurrencyExchangeBot</b></i>,\n' \
                 'и я умею конвертировать разные валюты.\nЧтобы узнать ' \
                 'как составить запрос, напиши /help или /?.\nА чтобы узнать список ' \
                 'допустимых валют, которые я могу конвертировать, напиши /values или /!.'
    TEXT_HELP = 'Чтобы конвертировать валюту, наберите запрос в формате:\n' \
                '[<b>меняемая</b> валюта] [<b>получаемая</b> валюта] [количество ' \
                '<b>меняемой</b> валюты].\nНапример, перевести 100 долларов в рубли:\n' \
                '                  <b>доллар рубль 100</b>\nКоманды:\n/start: ' \
                'приветствие\n/help: получить эту справку\n/values: список допустимых валют'

    date = time.strftime("%d.%m.%Y", time.localtime())