import time

class Backyard:
    TOKEN = '5530983647:AAHEdM8zSltLVOQXddBCFVcXxtojgZbAy60'

    URL = 'https://min-api.cryptocompare.com/data/price?'

    KEYS = {
        'доллар': ['USD', "(США)"],
        'евро': ['EUR', "(Евросоюз)"],
        'рубль': ['RUB', "(Россия)"],
        'лира': ['TRY', "(Турция)"],
        'фунт': ['GBP', "(Великобритания)"],
        'шекель': ['ILS', "(Израиль)"],
        'крона': ['DKK', "(Дания)"],
        'гривна': ['UAH', "(Украина)"],
        'иена': ['JPY', "(Япония)"],
        'юань': ['CNY', "(Китай)"],
        'злотый': ['PLN', "(Польша)"],
        'песо': ['CUP', "(Куба)"],
        'биткоин': ['BTC', " "]
    }

    TEXT_HELLO = 'Привет!\nМеня зовут CurrencyExchangeBot,\n' \
                 'и я умею конвертировать разные валюты.\nЧтобы узнать ' \
                 'как составить запрос, напиши /help или /?.\nА чтобы узнать список ' \
                 'допустимых валют, которые я могу конвертировать, напиши /values или /!.'
    TEXT_HELP = 'Чтобы конвертировать валюту, наберите запрос в формате:\n' \
                '<меняемая валюта> <получаемая валюта> <количество меняемой валюты>.\n' \
                'Например:\n                  доллар рубль 100\nКоманды:\n/start: ' \
                'приветствие\n/help: получить эту справку\n/values: список допустимых валют'

    date = time.strftime("%d.%m.%Y", time.localtime())
